In [3]:
#We start by importing pandas to load help us load and manipulate the csv file
import pandas as pd

In [5]:
#Loading the customer details in csv file
customer_data_df = pd.read_csv('customer_details.csv')

## The Customer details/data set contains the following variables that we can use to make decisions on whether to give them loan or not
> Loan_ID : Unique Loan ID

> Gender : Male/ Female

> Married : Applicant married (Y/N)

> Dependents : Number of dependents

> Education : Applicant Education (Graduate/ Under Graduate)
> Self_Employed : Self employed (Y/N)

> ApplicantIncome : Applicant income

> CoapplicantIncome : Coapplicant income

> LoanAmount : Loan amount in thousands of dollars

> Loan_Amount_Term : Term of loan in months

> Credit_History : Credit history meets guidelines yes or no

> Property_Area : Urban/ Semi Urban/ Rural
> Loan_Status : Loan approved (Y/N) this is the target variable

## Let us check the first 5 and last 5 rows of the dataset

In [7]:
#View the first five row of the dataset
customer_data_df.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area
0,LP001015,Male,Yes,0,Graduate,No,5720,0,110.0,360.0,1.0,Urban
1,LP001022,Male,Yes,1,Graduate,No,3076,1500,126.0,360.0,1.0,Urban
2,LP001031,Male,Yes,2,Graduate,No,5000,1800,208.0,360.0,1.0,Urban
3,LP001035,Male,Yes,2,Graduate,No,2340,2546,100.0,360.0,NaN,Urban
4,LP001051,Male,No,0,Not Graduate,No,3276,0,78.0,360.0,1.0,Urban

In [8]:
#Check the last five rows of the dataset
customer_data_df.tail()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area
362,LP002971,Male,Yes,3+,Not Graduate,Yes,4009,1777,113.0,360.0,1.0,Urban
363,LP002975,Male,Yes,0,Graduate,No,4158,709,115.0,360.0,1.0,Urban
364,LP002980,Male,No,0,Graduate,No,3250,1993,126.0,360.0,NaN,Semiurban
365,LP002986,Male,Yes,0,Graduate,No,5000,2393,158.0,360.0,1.0,Rural
366,LP002989,Male,No,0,Graduate,Yes,9200,0,98.0,180.0,1.0,Rural

## We now need to fine the shape of our dataset
This is the number of rows and number of columns

In [9]:
#use shape attribute to get the shape of dataframe
customer_data_df.shape

(367, 12)

In [11]:
print("Number of Rows", customer_data_df.shape[0])
print("Number of Columns", customer_data_df.shape[1])

Number of Rows 367
Number of Columns 12

## We now need to get info about our dataset.

>The total number of rows
 Total number of columns
Datatypes of each column
and memory requirement

In [12]:
customer_data_df.info

<bound method DataFrame.info of       Loan_ID Gender Married Dependents     Education Self_Employed  \
0    LP001015   Male     Yes          0      Graduate            No
1    LP001022   Male     Yes          1      Graduate            No
2    LP001031   Male     Yes          2      Graduate            No
3    LP001035   Male     Yes          2      Graduate            No
4    LP001051   Male      No          0  Not Graduate            No
..        ...    ...     ...        ...           ...           ...
362  LP002971   Male     Yes         3+  Not Graduate           Yes
363  LP002975   Male     Yes          0      Graduate            No
364  LP002980   Male      No          0      Graduate            No
365  LP002986   Male     Yes          0      Graduate            No
366  LP002989   Male      No          0      Graduate           Yes

     ApplicantIncome  CoapplicantIncome  LoanAmount  Loan_Amount_Term  \
0               5720                  0       110.0             360.0
1               3076               1500       126.0             360.0
2               5000               1800       208.0             360.0
3               2340               2546       100.0             360.0
4               3276                  0        78.0             360.0
..               ...                ...         ...               ...
362             4009               1777       113.0             360.0
363             4158                709       115.0             360.0
364             3250               1993       126.0             360.0
365             5000               2393       158.0             360.0
366             9200                  0        98.0             180.0

     Credit_History Property_Area
0               1.0         Urban
1               1.0         Urban
2               1.0         Urban
3               NaN         Urban
4               1.0         Urban
..              ...           ...
362             1.0         Urban
363             1.0         Urban
364             NaN     Semiurban
365             1.0         Rural
366             1.0         Rural

[367 rows x 12 columns]>

## Check null values

In [15]:
customer_data_df.isnull().sum()

Loan_ID               0
Gender               11
Married               0
Dependents           10
Education             0
Self_Employed        23
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount            5
Loan_Amount_Term      6
Credit_History       29
Property_Area         0
dtype: int64

In [17]:
#Check the percentage of missing value pr column
customer_data_df.isnull().sum()*100 / len(customer_data_df)

Loan_ID              0.000000
Gender               2.997275
Married              0.000000
Dependents           2.724796
Education            0.000000
Self_Employed        6.267030
ApplicantIncome      0.000000
CoapplicantIncome    0.000000
LoanAmount           1.362398
Loan_Amount_Term     1.634877
Credit_History       7.901907
Property_Area        0.000000
dtype: float64

## Handling missing values

In [19]:
customer_data_df = customer_data_df.drop('Loan_ID', axis=1)

In [20]:
customer_data_df.head()

,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area
0,Male,Yes,0,Graduate,No,5720,0,110.0,360.0,1.0,Urban
1,Male,Yes,1,Graduate,No,3076,1500,126.0,360.0,1.0,Urban
2,Male,Yes,2,Graduate,No,5000,1800,208.0,360.0,1.0,Urban
3,Male,Yes,2,Graduate,No,2340,2546,100.0,360.0,NaN,Urban
4,Male,No,0,Not Graduate,No,3276,0,78.0,360.0,1.0,Urban

### Remove missing value for columns with percentage missing value of below 5%

In [22]:
columns = ['Gender','Dependents','LoanAmount','Loan_Amount_Term']

In [24]:
customer_data_df = customer_data_df.dropna(subset=columns)

In [25]:
#Check the percentage of missing value pr column
customer_data_df.isnull().sum()*100 / len(customer_data_df)

Gender               0.000000
Married              0.000000
Dependents           0.000000
Education            0.000000
Self_Employed        6.824926
ApplicantIncome      0.000000
CoapplicantIncome    0.000000
LoanAmount           0.000000
Loan_Amount_Term     0.000000
Credit_History       7.715134
Property_Area        0.000000
dtype: float64

### For the remaining two columns(Self_Employed and Credit_History) we will feel the missing values with No

In [26]:
customer_data_df['Self_Employed'].mode()

0    No
Name: Self_Employed, dtype: object

In [30]:
customer_data_df['Self_Employed'] = customer_data_df['Self_Employed'].fillna(customer_data_df['Self_Employed'].mode()[0])

In [31]:
#Check the percentage of missing value pr column
customer_data_df.isnull().sum()*100 / len(customer_data_df)

Gender               0.000000
Married              0.000000
Dependents           0.000000
Education            0.000000
Self_Employed        0.000000
ApplicantIncome      0.000000
CoapplicantIncome    0.000000
LoanAmount           0.000000
Loan_Amount_Term     0.000000
Credit_History       7.715134
Property_Area        0.000000
dtype: float64

In [33]:
customer_data_df['Self_Employed'].unique()

array(['No', 'Yes'], dtype=object)

In [34]:
customer_data_df['Credit_History'].unique()

array([ 1., nan,  0.])

In [36]:
#Most frequent value
customer_data_df['Credit_History'].mode()[0]

1.0

In [37]:
customer_data_df['Credit_History'] = customer_data_df['Credit_History'].fillna(customer_data_df['Credit_History'].mode()[0])

In [38]:
#Check the percentage of missing value pr column
customer_data_df.isnull().sum()*100 / len(customer_data_df)

Gender               0.0
Married              0.0
Dependents           0.0
Education            0.0
Self_Employed        0.0
ApplicantIncome      0.0
CoapplicantIncome    0.0
LoanAmount           0.0
Loan_Amount_Term     0.0
Credit_History       0.0
Property_Area        0.0
dtype: float64

## Next is handling categorical columns

In [42]:
customer_data_df.sample(10)

,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area
308,Male,Yes,1,Graduate,No,6825,0,162.0,360.0,1.0,Rural
252,Female,No,1,Graduate,No,4028,0,131.0,360.0,1.0,Semiurban
145,Female,No,0,Graduate,No,12941,0,150.0,300.0,1.0,Urban
343,Male,Yes,1,Graduate,No,4700,0,80.0,360.0,1.0,Urban
61,Male,Yes,0,Graduate,Yes,7016,292,125.0,360.0,1.0,Urban
176,Male,Yes,2,Not Graduate,No,2500,3333,131.0,360.0,1.0,Urban
237,Male,Yes,2,Not Graduate,No,6166,13983,102.0,360.0,1.0,Rural
41,Female,No,0,Graduate,No,3644,0,110.0,360.0,1.0,Urban
208,Female,No,0,Graduate,No,4213,0,80.0,360.0,1.0,Urban
84,Male,Yes,0,Graduate,No,4456,0,131.0,180.0,0.0,Semiurban

In [47]:
customer_data_df['Dependents'] = customer_data_df['Dependents'].replace(to_replace="3+", value=4)

In [49]:
customer_data_df['Dependents'].unique()

array(['0', '1', '2', 4], dtype=object)

## Assigning numerical values to columns with non-numerical values

*This columns include:*
- Gender	
- Married		
- Education	
- Self_Employed
- Property_Area

In [50]:
customer_data_df['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [53]:
customer_data_df['Gender'] = customer_data_df['Gender'].map({'Male':1, 'Female':0}).astype('int')

In [61]:
# Check unique values
customer_data_df['Property_Area'].unique()

array(['Urban', 'Semiurban', 'Rural'], dtype=object)

In [62]:
customer_data_df['Married'] = customer_data_df['Married'].map({'Yes':1, 'No':0}).astype('int')
customer_data_df['Education'] = customer_data_df['Education'].map({'Graduate':1, 'Not Graduate':0}).astype('int')
customer_data_df['Self_Employed'] = customer_data_df['Self_Employed'].map({'Yes':1, 'No':0}).astype('int')
customer_data_df['Property_Area'] = customer_data_df['Property_Area'].map({'Rural':0, 'Semiurban':2, 'Urban':1}).astype('int')

In [63]:
customer_data_df.head()

,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area
0,1,1,0,1,0,5720,0,110.0,360.0,1.0,1
1,1,1,1,1,0,3076,1500,126.0,360.0,1.0,1
2,1,1,2,1,0,5000,1800,208.0,360.0,1.0,1
3,1,1,2,1,0,2340,2546,100.0,360.0,1.0,1
4,1,0,0,0,0,3276,0,78.0,360.0,1.0,1